import time
import torch
from huggingface_hub import login
from transformers import AutoModelForCausalLM, AutoTokenizer

start_time = time.time()



# # 캐시 경로 삭제 후 로딩
# import shutil
# cache_dir = "~/.cache/huggingface/hub/models--naver-hyperclovax--HyperCLOVAX-SEED-Text-Instruct-1.5B"
# shutil.rmtree(cache_dir)  # 캐시 삭제

model = AutoModelForCausalLM.from_pretrained("naver-hyperclovax/HyperCLOVAX-SEED-Text-Instruct-1.5B", device_map="auto")
tokenizer = AutoTokenizer.from_pretrained("naver-hyperclovax/HyperCLOVAX-SEED-Text-Instruct-1.5B")


# title = "LG전자, 디자인 어워드서 ‘혁신상•최고혁신상’ 동시 수상"
# kw_list = ['LG전자', '디자', '어워드', '혁신상', '최고혁신상', '동시', '수상', 'LG전자', '레드닷', '디자', '어워드', '혁신상', '최고혁신상', '동시', 'LG전자', '레드닷', '디자', '어워드', '35개', '디자', '경쟁력', '입증', '23일', '레드닷', '디자', '어워드', '디자', '어워드', '디자', '세계', '어워드', 'LG전자', '무선', '투명', 'TV', '올레드', 'LG', '시그니처', '올레드', '최고상', '플랫폼', '스마트', '공간', '우수성', '최고혁신상', '이외', '냉장고', '세탁기', '건조기', 'TV', '에어컨', '공기', '청정기', '오디오', '모니터', '상업', '로봇', '제품', '본상', '수상', '다방면', '디자', '역량', '디자인경영센터장', '정욱준', 'LG', '전자', '디자인', '경영', '센터장', '고객', '라이프스타일', '혁신적', '디자인', '세계', '인정', '디자', '경쟁력', '지속', '강화', 'LG전자', '디자', '어워드', '36개', '수상']
# category_list = ['키오스크', 'TV', '프로젝터', '퍼스널뷰어', '모니터(모니터 액세서리 포함)', '디지털 카메라', '캠코더', '스피커']

title = "르노, 올해 1분기 글로벌 판매 6.5%↑…한국서 147.6% 성장세"
kw_list = ['르노', '글로벌', '판매', '6.5%', '한국', '147.6%', '성장세', '전동', '성장세', '르노', '차량', '전동', '성장세', '세계', '38만', '신차', '판매', '기록', '기간', '6.5%', '증가', '실적', '유럽', '한국', '중남미', '시장', '성장세', '시장', '글로벌', '자동차', '입지', '강화', '르노코리아', '르노', '본고장', '유럽', '신차', '판매', '증가', '전년', '동기', '대비', '3.8%', '전기차', '하이브리드', '동화', '차량', '실적', '견인', '유럽', '판매량', '르노', '전기차', '전년', '대비', '87.9%', '급증', '하이브리드', '판매', '46.1%', '유럽', '선정', '르노', '소형', '전기차', '일렉트릭', 'E-Tech', '1분기', '1만', '1위', '유럽', '소형', '전기차', '판매', '차지', '브랜드', '성장', '핵심', '동력', '자리매김', '플랜', '인터내셔널', '게임', '핵심', '거점', '한국', '시장', '르노코리아', '판매', '147.6%', '전년', '대비', '147.6%', '폭발적', '성장세', '기록', '중형', 'SUV', '그랑', '콜레오스', '1만', '차지', '내수', '반등', '콜레오스', '출시', '3월', '누적', '판매', '중형', 'SUV', '시장', '현대차', '기아', '3위', '존재감', '비중', '하이브리드', '모델', '85%', '전략', '환경', '전환', '주효', '유럽', '지역', '유럽', '르노', '판매', '11.6%', '성장', '중남미', '아르헨티나', '콜롬비아', '브라질', '호실적', '21.1%', '증가', '6만', '기록', '모로코', '클리오', '카디안', '효과', '45.5%', '성장', '르노', '2027년', '허브', '글로벌', '한국', '인도', '중남미', '터키', '모로코', '중심', '플랜', '인터내셔널', '게임', '전략', '본격적', '성과', '르노', '유럽', '르노', '소형', '전기', '크로스오버', 'SUV', '일렉트릭', 'E-Tech', '출시', '콜레오스', '진출', '글로벌', '시장', '신차', '전략', '수출', '확대', '계획', '업계', '르노', '전동', '집중', '지역별', '전략', '시장', '글로벌', '자동차', '브랜드', '경쟁력', '평가', '르노코리아', '관계자', '동화', '신차', '전략', '글로벌', '시장', '효과', '혁신적', '제품', '현지', '전략', '성장세']
category_list = ['키오스크', 'TV', '프로젝터', '퍼스널뷰어', '모니터(모니터 액세서리 포함)', '디지털 카메라', '캠코더', '스피커']

chat = [
    {"role": "system", "content": "너는 뉴스 기사를 분류하는 AI야."},
    {"role": "user", "content": f"""
제목: {', '.join(title)}
키워드: {', '.join(kw_list)}

위 제목과 키워드를 보고 다음 항목 중 관련 있는 카테고리를 최대 2개까지만 선택해줘(없으면 False로 대답해줘.):
{', '.join(category_list)}
"""}
]

with torch.no_grad():
    inputs = tokenizer.apply_chat_template(chat, add_generation_prompt=False, return_dict=True, return_tensors="pt")
    output_ids = model.generate(**inputs, max_new_tokens= 512, stop_strings=["<|endofturn|>", "<|stop|>"], tokenizer=tokenizer)

    generated_ids = output_ids[0][inputs["input_ids"].shape[1]:]  # 입력 길이만큼 슬라이스
    print(tokenizer.decode(generated_ids, skip_special_tokens=True))

    end_time = time.time()
    # 실행 시간 계산
    execution_time = end_time - start_time
    # 실행 시간 출력
    print(f"실행 시간: {execution_time}초")

